app/views/admin/show.html.erb

	<ul >
		<% @admin.hospital.departments.each do |dep| %>
---
SELECT  "hospitals".* FROM "hospitals"  WHERE "hospitals"."id" = $1 LIMIT 1  [["id", 7]]
SELECT "departments".* FROM "departments"  WHERE "departments"."hospital_id" = $1  [["hospital_id", 7]]