app/controllers/admin_controller.rb

SELECT  "admins".* FROM "admins"  WHERE "admins"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
  @admin = Admin.find(params[:id])