app/controllers/department_controller.rb

	def show
		@department = Department.find(params[:id])
		@groups = @department.groups
---
SELECT  "departments".* FROM "departments"  WHERE "departments"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "groups".* FROM "groups"  WHERE "groups"."department_id" = $1  [["department_id", 1]]