app/controllers/hospital_controller.rb

SELECT  "hospitals".* FROM "hospitals"  WHERE "hospitals"."id" = $1 LIMIT 1  [["id", "id"]]
SELECT "departments".* FROM "departments"  WHERE "departments"."hospital_id" = $1  [["hospital_id", 2]]
SELECT "users".* FROM "users"  WHERE (group.department.hospital = #<Hospital:0x007f7f7dc0d0b0>)
---
	def show
		hos = Hospital.find(params[:id])
		dep = hos.departments
		gro = dep.each(&:groups)
   @users = gro.each(&:users)