app/controllers/sessions_controller.rb

  def create
    user = Admin.find_by(email: params[:sessions][:email])
---
SELECT  "admins".* FROM "admins"  WHERE "admins"."email" = 'gabe@reingerrowe.biz' LIMIT 1